
## Plan Result (stg)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 0 to change, 1 to destroy.</code></pre>

* Create
  * module.application_insights.null_resource.fix_scheduled_query_rules_alert_v2[0]
* Replace
  * module.application_insights.azurerm_monitor_scheduled_query_rules_alert_v2.main[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.application_insights.azurerm_monitor_scheduled_query_rules_alert_v2.main[0] must be replaced
-/+ resource "azurerm_monitor_scheduled_query_rules_alert_v2" "main" {
      ~ created_with_api_version               = "2021-08-01" -> (known after apply)
      ~ id                                     = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/recipes-shared-infrastructure-stg/providers/Microsoft.Insights/scheduledQueryRules/Application Insights daily cap reached - recipes-sds-stg" -> (known after apply)
      ~ is_a_legacy_log_analytics_rule         = false -> (known after apply)
      ~ is_workspace_alerts_storage_configured = false -> (known after apply)
      ~ name                                   = "Application Insights daily cap reached - recipes-sds-stg" -> "Application-Insights-daily-cap-reached-recipes-sds-stg" # forces replacement
      - skip_query_validation                  = false -> null
        tags                                   = {
            "application"         = "core"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/recipes-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#platops-help"
            "environment"         = "staging"
            "managedBy"           = "Platform Operations"
        }
      - target_resource_types                  = [] -> null
        # (13 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.application_insights.null_resource.fix_scheduled_query_rules_alert_v2[0] will be created
  + resource "null_resource" "fix_scheduled_query_rules_alert_v2" {
      + id       = (known after apply)
      + triggers = {
          + "alert_id" = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":64,"Program":"tfcmt","SHA1":"","Target":"stg","Vars":{}} -->